lixc929/hardware/firmware/ch585/applications/half_scan/ch585_half_report.c
#include "ch585_half_report.h"

#include <string.h>

#include "aik_approval_control.h"
#include "aik_host_shortcut.h"
#include "aik_profile_format.h"
#include "aik_profile_shortcut.h"

#define HID_USAGE_A             0x04U
#define HID_USAGE_B             0x05U
#define HID_USAGE_C             0x06U
#define HID_USAGE_D             0x07U
#define HID_USAGE_E             0x08U
#define HID_USAGE_F             0x09U
#define HID_USAGE_G             0x0AU
#define HID_USAGE_H             0x0BU
#define HID_USAGE_I             0x0CU
#define HID_USAGE_J             0x0DU
#define HID_USAGE_K             0x0EU
#define HID_USAGE_L             0x0FU
#define HID_USAGE_M             0x10U
#define HID_USAGE_N             0x11U
#define HID_USAGE_O             0x12U
#define HID_USAGE_P             0x13U
#define HID_USAGE_Q             0x14U
#define HID_USAGE_R             0x15U
#define HID_USAGE_S             0x16U
#define HID_USAGE_T             0x17U
#define HID_USAGE_U             0x18U
#define HID_USAGE_V             0x19U
#define HID_USAGE_W             0x1AU
#define HID_USAGE_X             0x1BU
#define HID_USAGE_Y             0x1CU
#define HID_USAGE_Z             0x1DU
#define HID_USAGE_1             0x1EU
#define HID_USAGE_2             0x1FU
#define HID_USAGE_3             0x20U
#define HID_USAGE_4             0x21U
#define HID_USAGE_5             0x22U
#define HID_USAGE_6             0x23U
#define HID_USAGE_7             0x24U
#define HID_USAGE_8             0x25U
#define HID_USAGE_9             0x26U
#define HID_USAGE_0             0x27U
#define HID_USAGE_ENTER         0x28U
#define HID_USAGE_ESCAPE        0x29U
#define HID_USAGE_BACKSPACE     0x2AU
#define HID_USAGE_TAB           0x2BU
#define HID_USAGE_SPACE         0x2CU
#define HID_USAGE_MINUS         0x2DU
#define HID_USAGE_EQUAL         0x2EU
#define HID_USAGE_LEFT_BRACKET  0x2FU
#define HID_USAGE_RIGHT_BRACKET 0x30U
#define HID_USAGE_BACKSLASH     0x31U
#define HID_USAGE_SEMICOLON     0x33U
#define HID_USAGE_QUOTE         0x34U
#define HID_USAGE_GRAVE         0x35U
#define HID_USAGE_COMMA         0x36U
#define HID_USAGE_PERIOD        0x37U
#define HID_USAGE_SLASH         0x38U
#define HID_USAGE_CAPS_LOCK     0x39U
#define HID_USAGE_F1            0x3AU
#define HID_USAGE_F2            0x3BU
#define HID_USAGE_F3            0x3CU
#define HID_USAGE_F4            0x3DU
#define HID_USAGE_F5            0x3EU
#define HID_USAGE_F6            0x3FU
#define HID_USAGE_F7            0x40U
#define HID_USAGE_F8            0x41U
#define HID_USAGE_F9            0x42U
#define HID_USAGE_F10           0x43U
#define HID_USAGE_F11           0x44U
#define HID_USAGE_F12           0x45U
#define HID_USAGE_RIGHT_ARROW   0x4FU
#define HID_USAGE_LEFT_ARROW    0x50U
#define HID_USAGE_DOWN_ARROW    0x51U
#define HID_USAGE_UP_ARROW      0x52U

#define HID_MOD_LEFT_CTRL   0x01U
#define HID_MOD_LEFT_SHIFT  0x02U
#define HID_MOD_LEFT_ALT    0x04U
#define HID_MOD_LEFT_GUI    0x08U
#define HID_MOD_RIGHT_CTRL  0x10U
#define HID_MOD_RIGHT_SHIFT 0x20U
#define HID_MOD_RIGHT_ALT   0x40U
#define HID_MOD_RIGHT_GUI   0x80U

#define CH585_FN_LAYER_KEY       38U
#define CH585_PROFILE_SLOT0_KEY  10U
#define CH585_PROFILE_SLOT1_KEY  52U
#define CH585_PROFILE_SLOT2_KEY  51U
#define CH585_PROFILE_SLOT3_KEY  50U
#define CH585_GLOBAL_DOWN_BYTES  ((AIK_KEY_COUNT_TOTAL + 7U) / 8U)

typedef struct
{
    uint8_t usage;
    uint8_t modifier_mask;
} ch585_key_output_t;

static const ch585_key_output_t s_factory_key_outputs[AIK_KEY_COUNT_TOTAL] =
{
    { HID_USAGE_F12, 0U },
    { HID_USAGE_F11, 0U },
    { HID_USAGE_F10, 0U },
    { HID_USAGE_F9, 0U },
    { HID_USAGE_F8, 0U },
    { HID_USAGE_F7, 0U },
    { HID_USAGE_F6, 0U },
    { HID_USAGE_BACKSPACE, 0U },
    { HID_USAGE_EQUAL, 0U },
    { HID_USAGE_MINUS, 0U },
    { HID_USAGE_0, 0U },
    { HID_USAGE_9, 0U },
    { HID_USAGE_8, 0U },
    { HID_USAGE_7, 0U },
    { HID_USAGE_BACKSLASH, 0U },
    { HID_USAGE_RIGHT_BRACKET, 0U },
    { HID_USAGE_LEFT_BRACKET, 0U },
    { HID_USAGE_P, 0U },
    { HID_USAGE_O, 0U },
    { HID_USAGE_I, 0U },
    { HID_USAGE_U, 0U },
    { HID_USAGE_Y, 0U },
    { HID_USAGE_ENTER, 0U },
    { HID_USAGE_QUOTE, 0U },
    { HID_USAGE_SEMICOLON, 0U },
    { HID_USAGE_L, 0U },
    { HID_USAGE_K, 0U },
    { HID_USAGE_J, 0U },
    { HID_USAGE_H, 0U },
    { 0U, HID_MOD_RIGHT_SHIFT },
    { HID_USAGE_SLASH, 0U },
    { HID_USAGE_PERIOD, 0U },
    { HID_USAGE_COMMA, 0U },
    { HID_USAGE_M, 0U },
    { HID_USAGE_N, 0U },
    { HID_USAGE_B, 0U },
    { 0U, HID_MOD_RIGHT_CTRL },
    { 0U, HID_MOD_RIGHT_GUI },
    { 0U, 0U },
    { 0U, HID_MOD_RIGHT_ALT },
    { HID_USAGE_SPACE, 0U },
    { HID_USAGE_F5, 0U },
    { HID_USAGE_F4, 0U },
    { HID_USAGE_F3, 0U },
    { HID_USAGE_F2, 0U },
    { HID_USAGE_F1, 0U },
    { HID_USAGE_ESCAPE, 0U },
    { HID_USAGE_6, 0U },
    { HID_USAGE_5, 0U },
    { HID_USAGE_4, 0U },
    { HID_USAGE_3, 0U },
    { HID_USAGE_2, 0U },
    { HID_USAGE_1, 0U },
    { HID_USAGE_GRAVE, 0U },
    { HID_USAGE_Y, 0U },
    { HID_USAGE_T, 0U },
    { HID_USAGE_R, 0U },
    { HID_USAGE_E, 0U },
    { HID_USAGE_W, 0U },
    { HID_USAGE_Q, 0U },
    { HID_USAGE_TAB, 0U },
    { HID_USAGE_G, 0U },
    { HID_USAGE_F, 0U },
    { HID_USAGE_D, 0U },
    { HID_USAGE_S, 0U },
    { HID_USAGE_A, 0U },
    { HID_USAGE_CAPS_LOCK, 0U },
    { HID_USAGE_B, 0U },
    { HID_USAGE_V, 0U },
    { HID_USAGE_C, 0U },
    { HID_USAGE_X, 0U },
    { HID_USAGE_Z, 0U },
    { 0U, HID_MOD_LEFT_SHIFT },
    { HID_USAGE_SPACE, 0U },
    { 0U, HID_MOD_LEFT_ALT },
    { 0U, HID_MOD_LEFT_GUI },
    { 0U, HID_MOD_LEFT_CTRL },
};

typedef struct
{
    uint8_t target_kind;   /* AIK_HP_TARGET_* */
    uint16_t value;
} ch585_local_binding_t;

#define CH585_LOCAL_SIGNAL_COUNT 11U

static const ch585_local_binding_t
s_factory_locals[CH585_LOCAL_SIGNAL_COUNT] =
{
    /* AIK_HP_SIGNAL_FIVEWAY_UP    */ { AIK_HP_TARGET_KEYBOARD, HID_USAGE_UP_ARROW },
    /* AIK_HP_SIGNAL_FIVEWAY_DOWN  */ { AIK_HP_TARGET_KEYBOARD, HID_USAGE_DOWN_ARROW },
    /* AIK_HP_SIGNAL_FIVEWAY_LEFT  */ { AIK_HP_TARGET_KEYBOARD, HID_USAGE_LEFT_ARROW },
    /* AIK_HP_SIGNAL_FIVEWAY_RIGHT */ { AIK_HP_TARGET_KEYBOARD, HID_USAGE_RIGHT_ARROW },
    /* AIK_HP_SIGNAL_FIVEWAY_PRESS */ { AIK_HP_TARGET_KEYBOARD, HID_USAGE_ENTER },
    /* AIK_HP_SIGNAL_WHEEL_UP      */ { AIK_HP_TARGET_MOUSE_WHEEL, 0x0001U },
    /* AIK_HP_SIGNAL_WHEEL_DOWN    */ { AIK_HP_TARGET_MOUSE_WHEEL, 0x00FFU },
    /* (reserved)                  */ { AIK_HP_TARGET_NONE, 0U },
    /* AIK_HP_SIGNAL_EC11_CW       */ { AIK_HP_TARGET_CONSUMER, AIK_CONSUMER_USAGE_VOLUME_UP },
    /* AIK_HP_SIGNAL_EC11_CCW      */ { AIK_HP_TARGET_CONSUMER, AIK_CONSUMER_USAGE_VOLUME_DOWN },
    /* AIK_HP_SIGNAL_EC11_PRESS    */ { AIK_HP_TARGET_CONSUMER, AIK_CONSUMER_USAGE_MUTE },
};

static ch585_key_output_t s_key_outputs[AIK_KEY_COUNT_TOTAL];
static ch585_key_output_t s_fn_outputs[AIK_KEY_COUNT_TOTAL];
static ch585_local_binding_t s_locals[CH585_LOCAL_SIGNAL_COUNT];
static uint8_t s_tables_ready;
static uint8_t s_has_fn_overlay;
static uint8_t s_fn_hold_key = 0xFFU;
static uint8_t s_legacy_fn_enabled;
static uint8_t s_fn_consumed[CH585_GLOBAL_DOWN_BYTES];
static aik_host_shortcut_state_t s_host_shortcut;
static aik_profile_shortcut_state_t s_profile_shortcut;
static uint8_t s_mode_shortcut_active;
static uint8_t s_mode_shortcut_consumed_mask;
static aik_approval_control_state_t s_approval_control;
static uint8_t s_approval_active;
static uint8_t s_approval_selected_yes;
static uint8_t s_approval_right_state_valid;

static void half_report_ensure_tables(void)
{
    if(s_tables_ready == 0U)
    {
        ch585_half_report_reset_factory();
    }
}

void ch585_half_report_reset_factory(void)
{
    if(s_tables_ready == 0U)
    {
        aik_profile_shortcut_reset(&s_profile_shortcut);
        s_mode_shortcut_active = 0U;
        s_mode_shortcut_consumed_mask = 0U;
        aik_approval_control_reset(&s_approval_control);
    }
    memcpy(s_key_outputs, s_factory_key_outputs, sizeof(s_key_outputs));
    memset(s_fn_outputs, 0, sizeof(s_fn_outputs));
    memcpy(s_locals, s_factory_locals, sizeof(s_locals));
    memset(s_fn_consumed, 0, sizeof(s_fn_consumed));
    s_has_fn_overlay = 0U;
    s_fn_hold_key = 0xFFU;
    s_legacy_fn_enabled = 1U;
    s_tables_ready = 1U;
}

