lixc929/hardware/firmware/ch585/applications/half_scan/ch585_half_report.c
void ch585_half_report_set_approval_context(uint8_t active,
                                            uint8_t selected_yes,
                                            uint8_t right_state_valid)
{
    s_approval_active = (active != 0U) ? 1U : 0U;
    s_approval_selected_yes = (selected_yes != 0U) ? 1U : 0U;
    s_approval_right_state_valid =
        (right_state_valid != 0U) ? 1U : 0U;
}

void ch585_half_report_set_key_outputs(
    const uint8_t pairs[AIK_KEY_COUNT_TOTAL * 2U])
{
    uint8_t key_id;

    half_report_ensure_tables();
    for(key_id = 0U; key_id < AIK_KEY_COUNT_TOTAL; key_id++)
    {
        s_key_outputs[key_id].usage = pairs[(uint16_t)key_id * 2U];
        s_key_outputs[key_id].modifier_mask =
            pairs[((uint16_t)key_id * 2U) + 1U];
    }
    s_legacy_fn_enabled =
        (uint8_t)((s_key_outputs[CH585_FN_LAYER_KEY].usage == 0U) &&
                  (s_key_outputs[CH585_FN_LAYER_KEY].modifier_mask == 0U));
}

void ch585_half_report_clear_fn_overlay(void)
{
    half_report_ensure_tables();
    memset(s_fn_outputs, 0, sizeof(s_fn_outputs));
    memset(s_fn_consumed, 0, sizeof(s_fn_consumed));
    s_has_fn_overlay = 0U;
    s_fn_hold_key = 0xFFU;
    s_legacy_fn_enabled =
        (uint8_t)((s_key_outputs[CH585_FN_LAYER_KEY].usage == 0U) &&
                  (s_key_outputs[CH585_FN_LAYER_KEY].modifier_mask == 0U));
}

void ch585_half_report_set_fn_overlay(
    uint8_t hold_key,
    const uint8_t pairs[AIK_KEY_COUNT_TOTAL * 2U])
{
    uint8_t key_id;

    half_report_ensure_tables();
    if((hold_key >= AIK_KEY_COUNT_TOTAL) || (pairs == 0))
    {
        return;
    }
    for(key_id = 0U; key_id < AIK_KEY_COUNT_TOTAL; key_id++)
    {
        s_fn_outputs[key_id].usage = pairs[(uint16_t)key_id * 2U];
        s_fn_outputs[key_id].modifier_mask =
            pairs[((uint16_t)key_id * 2U) + 1U];
    }
    memset(s_fn_consumed, 0, sizeof(s_fn_consumed));
    s_has_fn_overlay = 1U;
    s_fn_hold_key = hold_key;
    s_legacy_fn_enabled = 0U;
}

void ch585_half_report_clear_locals(void)
{
    half_report_ensure_tables();
    memset(s_locals, 0, sizeof(s_locals));
}

void ch585_half_report_set_local(uint8_t signal_id, uint8_t target_kind,
                                 uint16_t value)
{
    half_report_ensure_tables();
    if(signal_id < CH585_LOCAL_SIGNAL_COUNT)
    {
        s_locals[signal_id].target_kind = target_kind;
        s_locals[signal_id].value = value;
    }
}

static uint8_t local_signal_down(uint8_t signal_id,
                                 const aik_spi_half_state_v1_t *left,
                                 const aik_spi_half_state_v1_t *right)
{
    switch(signal_id)
    {
        case AIK_HP_SIGNAL_FIVEWAY_UP:
            return (left != 0) ?
                   aik_spi_half_bit_down(left, AIK_LEFT_LOCAL_BIT_SCR_UP) : 0U;
        case AIK_HP_SIGNAL_FIVEWAY_DOWN:
            return (left != 0) ?
                   aik_spi_half_bit_down(left, AIK_LEFT_LOCAL_BIT_SCR_DOWN) : 0U;
        case AIK_HP_SIGNAL_FIVEWAY_LEFT:
            return (left != 0) ?
                   aik_spi_half_bit_down(left, AIK_LEFT_LOCAL_BIT_SCR_LEFT) : 0U;
        case AIK_HP_SIGNAL_FIVEWAY_RIGHT:
            return (left != 0) ?
                   aik_spi_half_bit_down(left, AIK_LEFT_LOCAL_BIT_SCR_RIGHT) : 0U;
        case AIK_HP_SIGNAL_FIVEWAY_PRESS:
            return (left != 0) ?
                   aik_spi_half_bit_down(left, AIK_LEFT_LOCAL_BIT_SCR_CENTER) : 0U;
        case AIK_HP_SIGNAL_WHEEL_UP:
            return (left != 0) ?
                   aik_spi_half_bit_down(left, AIK_LEFT_LOCAL_BIT_SCR_WHEEL_UP) : 0U;
        case AIK_HP_SIGNAL_WHEEL_DOWN:
            return (left != 0) ?
                   aik_spi_half_bit_down(left, AIK_LEFT_LOCAL_BIT_SCR_WHEEL_DOWN) : 0U;
        case AIK_HP_SIGNAL_EC11_CW:
            return (right != 0) ?
                   aik_spi_half_bit_down(right, AIK_RIGHT_LOCAL_BIT_EC11_CW) : 0U;
        case AIK_HP_SIGNAL_EC11_CCW:
            return (right != 0) ?
                   aik_spi_half_bit_down(right, AIK_RIGHT_LOCAL_BIT_EC11_CCW) : 0U;
        case AIK_HP_SIGNAL_EC11_PRESS:
            return (right != 0) ?
                   aik_spi_half_bit_down(right, AIK_RIGHT_LOCAL_BIT_EC11_MUTE) : 0U;
        default:
            return 0U;
    }
}

static uint8_t half_key_down(const aik_spi_half_state_v1_t *half,
                             uint8_t key_id)
{
    if(half == 0)
    {
        return 0U;
    }
    return (uint8_t)((half->down_bits[key_id >> 3] >> (key_id & 7U)) & 1U);
}

static void nkro16_set_usage(uint8_t nkro16[AIK_NKRO_REPORT_BYTES],
                             uint8_t usage)
{
    if((nkro16 != 0) && (usage >= HID_USAGE_A))
    {
        uint8_t bit_index = (uint8_t)(usage - HID_USAGE_A);
        uint8_t byte_index = (uint8_t)(2U + (bit_index >> 3));
        uint8_t bit_mask = (uint8_t)(1U << (bit_index & 7U));

        if(byte_index < AIK_NKRO_REPORT_BYTES)
        {
            nkro16[byte_index] |= bit_mask;
        }
    }
}

static uint8_t global_key_down(const aik_spi_half_state_v1_t *left,
                               const aik_spi_half_state_v1_t *right,
                               uint8_t key_id)
{
    if(key_id < AIK_KEY_COUNT_RIGHT)
    {
        return half_key_down(right, key_id);
    }

    return half_key_down(left, (uint8_t)(key_id - AIK_KEY_COUNT_RIGHT));
}

static uint8_t profile_shortcut_slot_bit(uint8_t key_id)
{
    switch(key_id)
    {
        case CH585_PROFILE_SLOT0_KEY:
            return (uint8_t)(1U << AIK_PROFILE_SLOT_FACTORY);
        case CH585_PROFILE_SLOT1_KEY:
            return (uint8_t)(1U << AIK_PROFILE_USER_SLOT_FIRST);
        case CH585_PROFILE_SLOT2_KEY:
            return (uint8_t)(1U << (AIK_PROFILE_USER_SLOT_FIRST + 1U));
        case CH585_PROFILE_SLOT3_KEY:
            return (uint8_t)(1U << (AIK_PROFILE_USER_SLOT_FIRST + 2U));
        default:
            return 0U;
    }
}

static uint8_t mode_shortcut_key_bit(uint8_t key_id)
{
    switch(key_id)
    {
        case 45U:
            return 0x01U;
        case 44U:
            return 0x02U;
        case 43U:
            return 0x04U;
        default:
            return 0U;
    }
}

static uint8_t mode_shortcut_key_mask(
    const aik_spi_half_state_v1_t *left,
    const aik_spi_half_state_v1_t *right)
{
    uint8_t mask = 0U;

