lixc929/hardware/firmware/ch585/applications/half_scan/ch585_half_report.c
    if(global_key_down(left, right, 45U) != 0U)
    {
        mask |= 0x01U;
    }
    if(global_key_down(left, right, 44U) != 0U)
    {
        mask |= 0x02U;
    }
    if(global_key_down(left, right, 43U) != 0U)
    {
        mask |= 0x04U;
    }
    return mask;
}

static uint8_t profile_shortcut_slot_mask(
    const aik_spi_half_state_v1_t *left,
    const aik_spi_half_state_v1_t *right)
{
    uint8_t mask = 0U;

    if(global_key_down(left, right, CH585_PROFILE_SLOT0_KEY) != 0U)
    {
        mask |= (uint8_t)(1U << AIK_PROFILE_SLOT_FACTORY);
    }
    if(global_key_down(left, right, CH585_PROFILE_SLOT1_KEY) != 0U)
    {
        mask |= (uint8_t)(1U << AIK_PROFILE_USER_SLOT_FIRST);
    }
    if(global_key_down(left, right, CH585_PROFILE_SLOT2_KEY) != 0U)
    {
        mask |= (uint8_t)(1U << (AIK_PROFILE_USER_SLOT_FIRST + 1U));
    }
    if(global_key_down(left, right, CH585_PROFILE_SLOT3_KEY) != 0U)
    {
        mask |= (uint8_t)(1U << (AIK_PROFILE_USER_SLOT_FIRST + 2U));
    }
    return mask;
}

static uint8_t s_release_gate[CH585_GLOBAL_DOWN_BYTES];

void ch585_half_report_arm_release_gate(const aik_spi_half_state_v1_t *left,
                                        const aik_spi_half_state_v1_t *right)
{
    uint8_t key_id;

    memset(s_release_gate, 0, sizeof(s_release_gate));
    for(key_id = 0U; key_id < AIK_KEY_COUNT_TOTAL; key_id++)
    {
        if(global_key_down(left, right, key_id) != 0U)
        {
            s_release_gate[key_id >> 3] |= (uint8_t)(1U << (key_id & 7U));
        }
    }
}

static uint8_t fn_consumed_get(const uint8_t consumed[CH585_GLOBAL_DOWN_BYTES],
                               uint8_t key_id)
{
    return (uint8_t)((consumed[key_id >> 3] >> (key_id & 7U)) & 1U);
}

static void fn_consumed_set(uint8_t consumed[CH585_GLOBAL_DOWN_BYTES],
                            uint8_t key_id)
{
    consumed[key_id >> 3] |= (uint8_t)(1U << (key_id & 7U));
}

static void fn_consumed_clear(uint8_t consumed[CH585_GLOBAL_DOWN_BYTES],
                              uint8_t key_id)
{
    consumed[key_id >> 3] &= (uint8_t)~(uint8_t)(1U << (key_id & 7U));
}

static void update_fn_consumed(const aik_spi_half_state_v1_t *left,
                               const aik_spi_half_state_v1_t *right,
                               uint8_t consumed[CH585_GLOBAL_DOWN_BYTES])
{
    uint8_t key_id;
    uint8_t fn_down = global_key_down(left, right, CH585_FN_LAYER_KEY);

    for(key_id = 0U; key_id < AIK_KEY_COUNT_TOTAL; key_id++)
    {
        if(global_key_down(left, right, key_id) == 0U)
        {
            fn_consumed_clear(consumed, key_id);
        }
    }

    if(fn_down != 0U)
    {
        for(key_id = 0U; key_id < AIK_KEY_COUNT_TOTAL; key_id++)
        {
            if(global_key_down(left, right, key_id) != 0U)
            {
                fn_consumed_set(consumed, key_id);
            }
        }
    }
}

static void apply_local_keyboard_controls(const aik_spi_half_state_v1_t *left,
                                          const aik_spi_half_state_v1_t *right,
                                          uint8_t suppress_center,
                                          uint8_t suppress_approval_directions,
                                          uint8_t suppress_approval_confirm,
                                          uint8_t nkro16[AIK_NKRO_REPORT_BYTES])
{
    uint8_t signal_id;

    for(signal_id = 0U; signal_id < CH585_LOCAL_SIGNAL_COUNT; signal_id++)
    {
        const ch585_local_binding_t *binding = &s_locals[signal_id];

        if(binding->target_kind != AIK_HP_TARGET_KEYBOARD)
        {
            continue;
        }
        if((suppress_center != 0U) &&
           (signal_id == AIK_HP_SIGNAL_FIVEWAY_PRESS))
        {
            continue;
        }
        if((suppress_approval_directions != 0U) &&
           ((signal_id == AIK_HP_SIGNAL_FIVEWAY_UP) ||
            (signal_id == AIK_HP_SIGNAL_FIVEWAY_DOWN)))
        {
            continue;
        }
        if((suppress_approval_confirm != 0U) &&
           (signal_id == AIK_HP_SIGNAL_EC11_PRESS))
        {
            continue;
        }
        if(local_signal_down(signal_id, left, right) == 0U)
        {
            continue;
        }
        nkro16[0] |= (uint8_t)((binding->value >> 8) & 0xFFU);
        nkro16_set_usage(nkro16, (uint8_t)(binding->value & 0xFFU));
    }
}

void ch585_half_report_build_nkro16(const aik_spi_half_state_v1_t *left,
                                    const aik_spi_half_state_v1_t *right,
                                    uint8_t nkro16[AIK_NKRO_REPORT_BYTES])
{
    uint8_t key_id;
    uint8_t fn_active = 0U;
    uint8_t host_shortcut_action;
    uint8_t profile_slot_mask;
    uint8_t profile_consumed_mask;
    uint8_t mode_key_mask;
    uint8_t approval_nav_action;
    uint8_t approval_nav_consumed;
    uint8_t approval_confirm_action;
    uint8_t approval_confirm_consumed;
    uint8_t approval_any_consumed;
    uint8_t fn_down;

    if(nkro16 == 0)
    {
        return;
    }

    memset(nkro16, 0, AIK_NKRO_REPORT_BYTES);
    half_report_ensure_tables();
    fn_down = global_key_down(left, right, CH585_FN_LAYER_KEY);
    mode_key_mask = mode_shortcut_key_mask(left, right);
    s_mode_shortcut_consumed_mask &= mode_key_mask;
    if((fn_down != 0U) &&
       ((mode_key_mask == 0x01U) ||
        (mode_key_mask == 0x02U) ||
        (mode_key_mask == 0x04U)))
    {
        s_mode_shortcut_active = 1U;
        s_mode_shortcut_consumed_mask |= mode_key_mask;
    }
    else if((fn_down == 0U) && (s_mode_shortcut_consumed_mask == 0U))
    {
        s_mode_shortcut_active = 0U;
    }
    approval_nav_action = aik_approval_control_update_nav_valid(
        &s_approval_control,
        s_approval_active,
        fn_down,
        (left != 0) ?
            aik_spi_half_bit_down(
                left, AIK_LEFT_LOCAL_BIT_SCR_UP) :
            0U,
        (left != 0) ?
            aik_spi_half_bit_down(
                left, AIK_LEFT_LOCAL_BIT_SCR_DOWN) :
            0U,
        (left != 0) ? 1U : 0U);
    (void)approval_nav_action;
    approval_confirm_action =
        aik_approval_control_update_confirm_valid(
            &s_approval_control,
            s_approval_active,
            s_approval_selected_yes,
            fn_down,
            (right != 0) ?
                aik_spi_half_bit_down(
                    right, AIK_RIGHT_LOCAL_BIT_EC11_MUTE) :
                0U,
            s_approval_right_state_valid);
    approval_nav_consumed =
        aik_approval_control_nav_consumed(&s_approval_control);
    approval_confirm_consumed =
        aik_approval_control_confirm_consumed(&s_approval_control);
    approval_any_consumed =
        aik_approval_control_any_consumed(&s_approval_control);
    profile_slot_mask = profile_shortcut_slot_mask(left, right);
    (void)aik_profile_shortcut_update_valid(
        &s_profile_shortcut,
        (approval_any_consumed == 0U) ? fn_down : 0U,
        profile_slot_mask,
        (right != 0) ? 1U : 0U);
    profile_consumed_mask = aik_profile_shortcut_consumed_slot_mask(
        &s_profile_shortcut, profile_slot_mask);
    host_shortcut_action = aik_host_shortcut_update(
        &s_host_shortcut,
        ((aik_profile_shortcut_consuming(&s_profile_shortcut) != 0U) ||
         (approval_any_consumed != 0U)) ?
            0U :
            fn_down,
        (left != 0) ?
            aik_spi_half_bit_down(
                left,
                AIK_LEFT_LOCAL_BIT_SCR_CENTER_QUALIFIED) :
            0U);
    if((s_has_fn_overlay != 0U) &&
       (s_fn_hold_key < AIK_KEY_COUNT_TOTAL) &&
       (global_key_down(left, right, s_fn_hold_key) != 0U))
    {
        fn_active = 1U;
    }
    if(s_legacy_fn_enabled != 0U)
    {
        update_fn_consumed(left, right, s_fn_consumed);
    }
    for(key_id = 0U; key_id < AIK_KEY_COUNT_TOTAL; key_id++)
    {
        const ch585_key_output_t *output = &s_key_outputs[key_id];
        uint8_t gate_bit = (uint8_t)(1U << (key_id & 7U));

        if(global_key_down(left, right, key_id) == 0U)
        {
            s_release_gate[key_id >> 3] &= (uint8_t)~gate_bit;
            continue;
        }

        if((s_release_gate[key_id >> 3] & gate_bit) != 0U)
        {
            continue;
        }
        if(((host_shortcut_action != AIK_HOST_SHORTCUT_NONE) ||
            (approval_any_consumed != 0U)) &&
           (key_id == CH585_FN_LAYER_KEY))
        {
            continue;
        }
        if((aik_profile_shortcut_consuming(&s_profile_shortcut) != 0U) &&
           (key_id == CH585_FN_LAYER_KEY))
        {
            continue;
        }
        if((profile_consumed_mask & profile_shortcut_slot_bit(key_id)) != 0U)
        {
            continue;
        }
        if((s_mode_shortcut_active != 0U) &&
           ((key_id == CH585_FN_LAYER_KEY) ||
            ((s_mode_shortcut_consumed_mask &
              mode_shortcut_key_bit(key_id)) != 0U)))
        {
            continue;
        }

        if((s_legacy_fn_enabled != 0U) &&
           (fn_consumed_get(s_fn_consumed, key_id) != 0U))
        {
            continue;
        }
        if((fn_active != 0U) && (key_id == s_fn_hold_key))
        {
            continue;
        }
        if(fn_active != 0U)
        {
            const ch585_key_output_t *fn_output = &s_fn_outputs[key_id];

            if((fn_output->usage != 0U) ||
               (fn_output->modifier_mask != 0U))
            {
                output = fn_output;
            }
        }

        if(output->modifier_mask != 0U)
        {
            nkro16[0] |= output->modifier_mask;
        }

        nkro16_set_usage(nkro16, output->usage);
    }

    apply_local_keyboard_controls(
        left,
        right,
        (uint8_t)(host_shortcut_action != AIK_HOST_SHORTCUT_NONE),
        approval_nav_consumed,
        approval_confirm_consumed,
        nkro16);
    aik_host_shortcut_apply(host_shortcut_action, nkro16);
    aik_approval_control_apply_confirm(
        approval_confirm_action, nkro16);
}

uint16_t ch585_half_report_consumer_usage(const aik_spi_half_state_v1_t *left,
                                          const aik_spi_half_state_v1_t *right)
{
    static const uint8_t priority[3] = {
        AIK_HP_SIGNAL_EC11_PRESS,
        AIK_HP_SIGNAL_EC11_CW,
        AIK_HP_SIGNAL_EC11_CCW
    };
    uint8_t i;

    half_report_ensure_tables();
    for(i = 0U; i < 3U; i++)
    {
        const ch585_local_binding_t *binding = &s_locals[priority[i]];

