lixc929/hardware/firmware/ch585/applications/half_scan/ch585_half_report.c
        if((priority[i] == AIK_HP_SIGNAL_EC11_PRESS) &&
           (aik_approval_control_confirm_consumed(
                &s_approval_control) != 0U))
        {
            continue;
        }
        if((binding->target_kind == AIK_HP_TARGET_CONSUMER) &&
           (local_signal_down(priority[i], left, right) != 0U))
        {
            return binding->value;
        }
    }
    return AIK_CONSUMER_USAGE_NONE;
}

int8_t ch585_half_report_mouse_wheel(const aik_spi_half_state_v1_t *left,
                                     const aik_spi_half_state_v1_t *right)
{
    static const uint8_t priority[2] = {
        AIK_HP_SIGNAL_WHEEL_UP,
        AIK_HP_SIGNAL_WHEEL_DOWN
    };
    uint8_t i;

    half_report_ensure_tables();
    for(i = 0U; i < 2U; i++)
    {
        const ch585_local_binding_t *binding = &s_locals[priority[i]];

        if((binding->target_kind == AIK_HP_TARGET_MOUSE_WHEEL) &&
           (local_signal_down(priority[i], left, right) != 0U))
        {
            return (int8_t)(binding->value & 0xFFU);
        }
    }
    return 0;
}

int8_t ch585_half_report_mouse_wheel_step(uint8_t signal_id)
{
    const ch585_local_binding_t *binding;

    half_report_ensure_tables();
    if((signal_id != AIK_HP_SIGNAL_WHEEL_UP) &&
       (signal_id != AIK_HP_SIGNAL_WHEEL_DOWN))
    {
        return 0;
    }
    binding = &s_locals[signal_id];
    if(binding->target_kind != AIK_HP_TARGET_MOUSE_WHEEL)
    {
        return 0;
    }
    return (int8_t)(binding->value & 0xFFU);
}
